In [4]:
import pandas as pd
import numpy as np
import glob
import statsmodels.api as sm
from statsmodels.tsa.api import VAR
from statsmodels.tsa.stattools import adfuller
import datetime

In [5]:
exchange_path = sorted(glob.glob('./../data/exchange/*'))
exchange = pd.read_csv(exchange_path[5])
exchange_CAD = exchange.iloc[22:]
exchange_CAD = exchange_CAD.reset_index().drop('index', axis = 1)
exchange_CAD = exchange_CAD.drop('Unnamed: 0', axis = 1)
exchange_CAD

            date      buy  standard
0     2022-03-31   986.89    970.15
1     2022-03-30   988.16    976.56
2     2022-03-29   993.60    979.11
3     2022-03-28  1000.83    975.93
4     2022-03-25   990.37    973.30
...          ...      ...       ...
4595  2003-09-30   869.25    850.17
4596  2003-09-29   862.23    850.62
4597  2003-09-26   867.33    853.30
4598  2003-09-25   870.15    853.83
4599  2003-09-24   865.35    848.83

[4600 rows x 3 columns]

In [6]:
exchange_CAD['ex'] = np.log(exchange_CAD['buy']) # % 데이터
exchange_CAD['ex'].isnull().sum()
exchange_CAD

            date      buy  standard        ex
0     2022-03-31   986.89    970.15  6.894559
1     2022-03-30   988.16    976.56  6.895845
2     2022-03-29   993.60    979.11  6.901335
3     2022-03-28  1000.83    975.93  6.908585
4     2022-03-25   990.37    973.30  6.898079
...          ...      ...       ...       ...
4595  2003-09-30   869.25    850.17  6.767631
4596  2003-09-29   862.23    850.62  6.759522
4597  2003-09-26   867.33    853.30  6.765420
4598  2003-09-25   870.15    853.83  6.768666
4599  2003-09-24   865.35    848.83  6.763134

[4600 rows x 4 columns]

In [7]:
import datetime
exchange_CAD['dt'] = pd.to_datetime(exchange_CAD['date'])
exchange_CAD['dt'] = exchange_CAD['dt'].dt.strftime('%Y-%m')
exchange_CAD

            date      buy  standard        ex       dt
0     2022-03-31   986.89    970.15  6.894559  2022-03
1     2022-03-30   988.16    976.56  6.895845  2022-03
2     2022-03-29   993.60    979.11  6.901335  2022-03
3     2022-03-28  1000.83    975.93  6.908585  2022-03
4     2022-03-25   990.37    973.30  6.898079  2022-03
...          ...      ...       ...       ...      ...
4595  2003-09-30   869.25    850.17  6.767631  2003-09
4596  2003-09-29   862.23    850.62  6.759522  2003-09
4597  2003-09-26   867.33    853.30  6.765420  2003-09
4598  2003-09-25   870.15    853.83  6.768666  2003-09
4599  2003-09-24   865.35    848.83  6.763134  2003-09

[4600 rows x 5 columns]

In [9]:
interest_path = sorted(glob.glob('./../data/interest/*'))
interest_path[-2]

'./../data/interest/40_south-korea_government_bond_rate_1year.csv'

In [10]:
interest_path = sorted(glob.glob('./../data/interest/*'))
interest_Canada = pd.read_csv(interest_path[3])
interest_Korea = pd.read_csv(interest_path[-2])
interest_CAD = interest_Canada.iloc[26:]
interest_KOR = interest_Korea.iloc[49:-658]
interest_CAD, interest_KOR

(      Unnamed: 0        date  interest  change
 26            26  2022-03-31      1.96   -1.01
 27            27  2022-03-30      1.98    6.45
 28            28  2022-03-29      1.86    0.54
 29            29  2022-03-28      1.85    1.09
 30            30  2022-03-25      1.83    5.78
 ...          ...         ...       ...     ...
 5072        4995  2003-09-30      2.59   -2.26
 5073        4996  2003-09-29      2.65    1.15
 5074        4997  2003-09-26      2.62   -0.38
 5075        4998  2003-09-25      2.63    0.38
 5076        4999  2003-09-24      2.62   -0.38

 [5051 rows x 4 columns],
       Unnamed: 0        date  interest  change
 49            49  2022-03-31     1.675    1.39
 50            50  2022-03-30     1.652   -0.12
 51            51  2022-03-29     1.654   -0.36
 52            52  2022-03-28     1.660    6.14
 53            53  2022-03-27     1.564    0.00
 ...          ...         ...       ...     ...
 4780        4337  2003-12-12     4.640   -0.43
 4781        4338  2003-12-05     4.660    3.56
 4782        4339  2003-11-25     4.500   11.94
 4783        4340  2003-10-08     4.020   -2.90
 4784        4341  2003-09-05     4.140   -2.13

 [4736 rows x 4 columns])

In [11]:
start_date = pd.to_datetime(exchange_CAD.iloc[-1,0]) ## 시작 날짜
end_date = pd.to_datetime(exchange_CAD.iloc[0,0]) ## 마지막 날짜
 
dates = pd.date_range(start_date,end_date,freq='D')
padding = pd.DataFrame({'date' : dates})
padding = padding.sort_values(by = 'date', ascending = False).reset_index().drop('index', axis = 1)
padding['date'] = padding['date'].dt.strftime('%Y-%m-%d')
padding

            date
0     2022-03-31
1     2022-03-30
2     2022-03-29
3     2022-03-28
4     2022-03-27
...          ...
6759  2003-09-28
6760  2003-09-27
6761  2003-09-26
6762  2003-09-25
6763  2003-09-24

[6764 rows x 1 columns]

In [12]:
interest_CAD_r = interest_CAD[['date', 'interest']]
interest_CAD_r = interest_CAD_r.rename(columns = {'interest' : 'int_CAD'})

interest_KOR_r = interest_KOR[['date', 'interest']]
interest_KOR_r = interest_KOR_r.rename(columns = {'interest' : 'int_KOR'})

In [13]:
padding_temp = pd.merge(padding,interest_CAD_r, on = 'date', how = 'outer')
padding_temp

            date  int_CAD
0     2022-03-31     1.96
1     2022-03-30     1.98
2     2022-03-29     1.86
3     2022-03-28     1.85
4     2022-03-27      NaN
...          ...      ...
6759  2003-09-28      NaN
6760  2003-09-27      NaN
6761  2003-09-26     2.62
6762  2003-09-25     2.63
6763  2003-09-24     2.62

[6764 rows x 2 columns]

In [2]:
def adf_test(timeseries):
    print("Results of Dickey-Fuller Test:")
    dftest = adfuller(timeseries, autolag="AIC")
    dfoutput = pd.Series(
        dftest[0:4],
        index=[
            "Test Statistic",
            "p-value",
            "#Lags Used",
            "Number of Observations Used",
        ],
    )
    for key, value in dftest[4].items():
        dfoutput["Critical Value (%s)" % key] = value
    print(dfoutput)